Repository: innovationstuff/LaborServices
Catalog: LaborServices.ViewModel/Resources/ValidationsResources.*.resx
Languages: ar

# AgreedToTerms
source: You must agree the terms
ar: يجب الموافق على الاتفاقية

# Availabledays
source: Enter Available days
ar: ادخل الايام المتاحة

# CityId
source: Enter the City
ar: ادخل المدينة

# CodeRequired
source: Please Enter Code
ar: ادخل الكود

# ComparePassword
source: The password and confirmation password do not match.
ar: كلمتا المرور غير متطابقتين

# ContactId
source: Contact is Required
ar: اختر المستخدم

# ContractDuration
source: Enter Contract Duration
ar: ادخل مدة التعاقد

# CurrentPassword
source: Enter Current Password
ar: ادخل كلمة المرور الحالية

# DistrictId
source: Enter District
ar: ادخل الحى

# EmailRequired
source: The Email Required
ar: البريد الالكترونى مطلوب

# Externalaccesstoken
source: External access token required
ar: رمز الوصول الخارجي المطلوب

# FullName
source: Enter Full Name
ar: ادخل الاسم بالكامل

# GenderId
source: Enter the Gender
ar: ادخل النوع

# IdNumber
source: Enter Iqama Number
ar: ادخل رقم الهوية

# JobTitle
source: Enter Job Title
ar: ادخل اسم الوظيفة

source: Login provider
ar: مزود تسجيل الدخول

# Nationality
source: Enter Nationality
ar: ادخل الجنسية

# NationalityId
source: Enter the Nationality
ar: ادخل الجنسية

# NotValidIqama
source: Iqama number Not Valid
ar: رقم الهوية غير صحيح

# NumberOfhours
source: Enter Number Of hours
ar: ادخل عدد الساعات

# NumberOfvisits
source: Enter Number Of visits
ar: ادخل عدد الزيارات

# NumberOfworkers
source: Enter Number Of workers
ar: ادخل عدد العمال

# packages
source: Select packages
ar: اختر الباقة

# Password
source: Password is Required
ar: كلمة المرور مطلوبة

# PasswordLength
source: The password must be at least 6 characters long.
ar: يجب ان لا تقل كلمة المرور عن 6 حروف

# PhoneRequired
source: Phone is Required
ar: رقم التليفون مطلوب

source: Provider key
ar: رمز مقدم الخدمة

# RegionId
source: Enter Region
ar: ادخل المنطقة

# RegisterComparePassword
source: The password and confirmation password do not match.
ar: كلمتا المرور غير متطابقتين

# RegisterNameIsRequired
source: FullName is required
ar: الاسم مطلوب

# RegisterPasswordIsRequired
source: Password is required
ar: كلمة المرور مطلوبة

# RegisterPhoneIsNotValed
source: Entered Phone not valid
ar: رقم الجوال غير صحيح

# RegisterPhoneIsRequired
source: MobilePhone is required
ar: رقم الجوال مطلوب

# Startday
source: Enter Start day
ar: ادخل تاريخ البدء

# ValidDate
source: Please Enter Valid Date
ar: من فضلك ادخل تاريخ صحيح

# CompanyId
source: Company is Required
ar: أدخل الشركة

# ConfirmNewPassword
source: The new password and confirmation password do not match.
ar: كلمتا المرور غير متطابقتين

# ContractId
source: Contract is Required
ar: اختر العقد

# Jobs
source: Jobs are Required
ar: أدخل المهن المطلوبة

# NewPassword
source: New password is required
ar: كلمة المرور الجديدة مطلوبة

# ProblemDetails
source: Ticket Details is Required
ar: أدخل تفاصيل المشكلة

# ProblemTypeId
source: Ticket type is Required
ar: ادخل نوع المشكلة

# RegisterFirstNameIsRequired
source: FirstName is required
ar: أدخل الإسم الأول

# RegisterLastNameIsRequired
source: LastName is required
ar: أدخل الإسم الأخير

# RegisterMiddleNameIsRequired
source: MiddleName is required
ar: أدخل الإسم الأوسط

# RegisterFirstNameExpresstion
source: First name must be Arabic or English characters only
ar: يجب أن يكون الإسم الأول حروف عربية او أنجليزية فقط

# RegisterLastNameExpresstion
source: Last name must be Arabic or English characters only
ar: يجب أن يكون الإسم الأخير حروف عربية او أنجليزية فقط

# RegisterMiddleNameExpresstion
source: Middle name must be Arabic or English characters only
ar: يجب أن يكون الإسم الأوسط حروف عربية او أنجليزية فقط

# RegisterFirstNameLength
source: First name must be at least 2 characters long
ar: يجب أن يكون الإسم الأول حرفين على الاقل

# RegisterLastNameLength
source: Last name must be at least 2 characters long
ar: يجب أن يكون الإسم الأخيرحرفين على الاقل

# RegisterMiddleNameLength
source: Middle name must be at least 2 characters long
ar: يجب أن يكون الإسم الأوسط حرفين على الاقل
